src/com/seleniumtest/sandboxmemperf.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="CSLN" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">5</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1000</stringProp>
        <longProp name="ThreadGroup.start_time">1311604461000</longProp>
        <longProp name="ThreadGroup.end_time">1311604461000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSampler guiclass="HttpTestSampleGui" testclass="HTTPSampler" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">sandbox.elgg178.parlicom.local</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSampler>
        <hashTree>
          <GaussianRandomTimer guiclass="GaussianRandomTimerGui" testclass="GaussianRandomTimer" testname="Gaussian Random Timer" enabled="true">
            <stringProp name="ConstantTimer.delay">3000</stringProp>
            <stringProp name="RandomTimer.range">200.0</stringProp>
          </GaussianRandomTimer>
          <hashTree/>
          <kg.apc.jmeter.perfmon.PerformanceMonitoringTestElement guiclass="kg.apc.jmeter.perfmon.ServerPerfMonitoringGUI" testclass="kg.apc.jmeter.perfmon.PerformanceMonitoringTestElement" testname="jp@gc - Servers Performance Monitoring" enabled="true">
            <collectionProp name="perfomdata">
              <collectionProp name="1490186244">
                <stringProp name="-1321751897">10.0.0.40</stringProp>
              </collectionProp>
              <collectionProp name="1494632332">
                <stringProp name="1600768">4444</stringProp>
              </collectionProp>
            </collectionProp>
            <intProp name="monitoringType">0</intProp>
          </kg.apc.jmeter.perfmon.PerformanceMonitoringTestElement>
          <hashTree/>
          <kg.apc.jmeter.perfmon.PerformanceMonitoringTestElement guiclass="kg.apc.jmeter.perfmon.ServerPerfMonitoringGUI" testclass="kg.apc.jmeter.perfmon.PerformanceMonitoringTestElement" testname="jp@gc - Servers Performance Monitoring" enabled="true">
            <collectionProp name="perfomdata">
              <collectionProp name="1490186244">
                <stringProp name="-1321751897">10.0.0.40</stringProp>
              </collectionProp>
              <collectionProp name="1494632332">
                <stringProp name="1600768">4444</stringProp>
              </collectionProp>
            </collectionProp>
            <intProp name="monitoringType">1</intProp>
          </kg.apc.jmeter.perfmon.PerformanceMonitoringTestElement>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>